In [16]:
import pandas as pd
import numpy as np
import requests
from bs4 import BeautifulSoup
import re

## Expressões Regulares
1 - Escreva código Python para remover os zeros de um endereço IP.

In [17]:

ip = "192.0.76.0.0.1"

# Ou começa por .0 ou acaba por 0.
sem_zeros = re.sub(r".0|0.", r"", ip)
sem_zeros

'192.76.1'

2 - Escreva e teste uma função Python que retorne ‘True’ se uma string contiver apenas caracteres 
alfanuméricos (a-z, A-Z e 0-9) e ‘False’ caso contrário.
Nota: a expressão “\w” pode reconhecer caracteres diferentes destes como sendo 
alfanuméricos.

In [18]:
def apenas_alpha_num(text):
    # Se contiver qualquer coisa não alfanumérica, então len > 0 logo não é alfanumérica
    return len(re.findall(r"[^a-zA-Z0-9]", text)) == 0

text1 = "olapessoa2"
text2 = "ola_pessoa"

print(f"\"{text1}\" é alfanumérico? ", apenas_alpha_num(text1))
print(f"\"{text2}\" é alfanumérico? ", apenas_alpha_num(text2))

"olapessoa2" é alfanumérico?  True
"ola_pessoa" é alfanumérico?  False

3 - Escreva e teste uma função Python que verifique se uma string consiste num ‘a’ seguido por 
zero ou mais ‘b’. A saída da função deve ser True/False, caso consista ou não, e a contagem 
dos 'b' encontrados. Se o match não ocorrer, a contagem dos 'b' deve ser zero.

In [19]:
def abbb(text):
    match = re.match(r"[a](b*)$", text)
    return (True, len(match.groups()[0])) if match else (False, 0)

abbb("abbb")

(True, 3)

4 - Escreva e teste uma função que verifique se um texto não tem nenhuma das letras ’k,y,w’, 
maiúsculas ou minúsculas. Deve ignorar os casos ‘ky’ e ‘wy’. Possíveis resultados da função:\
 
• Existem as letras "k,w,y", ignorando "wy" e "ky"\
. 
• Não existem as letras "k,w,y", ignorando "wy" e "ky". ".

In [20]:
def existe_kyw(text):

    # Contém os caracteres k,y,w
    l1 = len(re.findall(r"([kywKYW])", text))
    # Contém as substrings ky e wy
    l2 = len(re.findall(r"(ky|wy)", text))

    # l2 conta as occorrências de ky ou wy, logo a cada ocorrência há 2 letras que estarão contadas em l1
    # por isso multiplica-se por 2 para saber o número exato de letras a retirar da contagem l1
    if l1-(l2*2) > 0:
        print("Existem as letras \"k,w,y\", ignorando \"wy\" e \"ky\"")
    else:
        print("Não existem as letras \"k,w,y\", ignorando \"wy\" e \"ky\"")

existe_kyw("kyasgadgkdwyas")

Existem as letras "k,w,y", ignorando "wy" e "ky"

5 - Escreva uma função que receba uma string e um número. A função deve devolver todas as 
palavras que contenham pelo menos uma vez esse número.

In [21]:
def contem_num(text, num):
    #\b encontra o espaço entre um caracter alfanumérico e um não caracter alfanumérico 
    regex = r"\b[a-z|A-Z|0-9]*{num}[a-z|A-Z|0-9]*\b"
    regex = re.sub(r"{num}", str(num), regex)
    return re.findall(regex, text)

contem_num("ol2a_ tudo2 bom3 yea2h2", 2)

['tudo2', 'yea2h2']

6 - Escreva um programa Python para converter um string em que as palavras estão coladas, sem 
espaços em branco e começadas por letra maiúscul, exceto a primeira palavra,a (camel case) numa string em que as 
palavras estejam separadas por underscore (snake case).

In [22]:
def camel_2_snake(text):
    palavras = re.findall(r"^[a-z][a-z]*|[A-Z][a-z|0-9]*", text)
    return "_".join(palavras).lower()

camel_2_snake("agoraIstoVai")

'agora_isto_vai'

## DataFrames

1. Construa um DataFrame, recorrendo à biblioteca Pandas, com os seguintes atributos: 
{'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]} 
Saída: 
 X Y Z 
0 78 84 86 
1 85 94 97 
2 96 89 96 
3 80 83 72 
4 86 86 83

In [23]:
df = pd.DataFrame({"X": [78,85,96,80,86], "Y": [84,94,89,83,86], "Z": [86,97,96,72,83]})
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

2. Escreva um programa para obter as primeiras 3 linhas de um DataFrame. 
Dados para o DataFrame: 
exam_data = { 
'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 
'Jonas'], 
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [24]:
df = pd.DataFrame(
    { 
        'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }, 
    index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
)
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

3. Escreva um programa para mostrar as linhas onde o número de tentativas no exame é superior 
a 2. Utilize o DataFrame do exercício anterior

In [25]:
df[df["attempts"] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

4. Escreva um programa que mostre as linhas em que a pontuação está entre 15 e 20 (inclusive).

In [26]:
df[(df["score"] > 15) & (df["score"] <= 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

## Web Scraping

Para obter os HTMLs necessários temos de ir às [listas](https://dges.gov.pt/coloc/2023/) de candidatos para cada fase, no IPCB, para a Lic. de Eng. Informática

In [27]:
listas = list()
for lc in ["LC1.html", "LC2.html", "LC3.html"]:
    with open(lc, "r") as f:
        listas.append(f.read())

In [28]:
roots = [BeautifulSoup(listas[0]), BeautifulSoup(listas[1]), BeautifulSoup(listas[2])]

In [29]:
# Obter os numeros e nomes da tabela
numeros = list()
nomes = list()

# Regex para substituir caracteres brancos

for i, root in enumerate(roots):
    table = root.findAll("table")[3]
    td = table.findAll("td")
    for num, nome in zip(td[::2], td[1::2]):
        numeros.append(re.sub(r"\s", "", num.text))
        nomes.append(re.sub(r"[\t\r\n]", "", nome.text))

numeros

['308(...)11',
 '158(...)54',
 '303(...)84',
 '152(...)35',
 '305(...)12',
 '310(...)81',
 '309(...)26',
 '155(...)68',
 '307(...)87',
 '303(...)91',
 '303(...)29',
 '300(...)39',
 '307(...)75',
 '301(...)66',
 '154(...)16',
 '152(...)73',
 '304(...)48',
 '307(...)16',
 '310(...)25',
 '149(...)01',
 '305(...)11',
 '157(...)76',
 '303(...)43',
 '230(...)06',
 '159(...)88',
 '300(...)30',
 '308(...)39',
 '157(...)44',
 '302(...)36',
 '300(...)87',
 '301(...)09',
 '314(...)10',
 '154(...)09',
 '158(...)05',
 '155(...)35',
 '154(...)90',
 '306(...)95',
 '151(...)98',
 '305(...)85',
 '316(...)70',
 '159(...)63',
 '307(...)71',
 '149(...)42',
 '230(...)01',
 '307(...)61',
 '309(...)68',
 '311(...)84',
 '311(...)95',
 '307(...)97',
 '303(...)90',
 '151(...)01',
 '157(...)02',
 '304(...)27',
 '303(...)38',
 '301(...)74',
 '307(...)45',
 '306(...)13',
 '149(...)97',
 '307(...)37',
 '154(...)68',
 '304(...)75']

In [30]:
# Criar 4 listas
aluno_id = list()

for i, num in enumerate(numeros):
    aluno_id.append(int(re.sub(r"\(\.\.\.\)", str(i), num)))

primeiro_nome, ultimo_nome, nome_completo = list(), list(), list()
for nome in nomes:
    primeiro, ultimo = re.search(r"\w+", nome)[0], re.search(r"\w+$", nome)[0]
    primeiro_nome.append(primeiro)
    ultimo_nome.append(ultimo)
    nome_completo.append(nome)

In [31]:
df = pd.DataFrame({
    "aluno_id": aluno_id, 
    "primeiro_nome": primeiro_nome, 
    "ultimo_nome": ultimo_nome,
    "nome_completo": nome_completo
})
df

    aluno_id primeiro_nome ultimo_nome                    nome_completo
0     308011       BEATRIZ      COELHO  BEATRIZ ISABEL FERNANDES COELHO
1     158154       BEATRIZ   RODRIGUES         BEATRIZ MESTRE RODRIGUES
2     303284        DANIEL       SOUSA        DANIEL FERNANDES DE SOUSA
3     152335         DAVID      AFONSO     DAVID MIGUEL CARRONDO AFONSO
4     305412         DIOGO      SANTOS               DIOGO MALTA SANTOS
..       ...           ...         ...                              ...
56   3065613         SIMÃO       MAJOR          SIMÃO PAULO SILVA MAJOR
57   1495797         TOMÁS      SANTOS  TOMÁS AURÉLIO ABELHO DOS SANTOS
58   3075837        AFONSO       COSTA               AFONSO NEVES COSTA
59   1545968          JOÃO       NUNES        JOÃO MIGUEL MARTINS NUNES
60   3046075        RENATO       GOMES    RENATO JOSÉ DE OLIVEIRA GOMES

[61 rows x 4 columns]

## Base de Dados

Vou usar SQLite porque já é nativo do Python, enquanto que o SQL Server tem de se instalar e configurar um servidor de DB no nosso sistema.

```sql
CREATE TABLE aluno(
    aluno_id INT NOT NULL, 
    primeiro_nome VARCHAR(100) NOT NULL,
    ultimo_nome VARCHAR(100) NOT NULL, 
    nome_completo VARCHAR(100) NOT NULL, 
    PRIMARY KEY (aluno_id))
```

In [32]:
import sqlite3

In [33]:
# Cria a base de dados num ficheiro
conn = sqlite3.connect("aluno.db")
cur = conn.cursor()

In [34]:
# Cria tabela pedida (primeiro tenta-se apagar, caso não exista cria-se)
try:
    cur.execute("DROP TABLE aluno")
except:
    cur.execute(
        """CREATE TABLE aluno(aluno_id INT NOT NULL, primeiro_nome VARCHAR(100) NOT NULL,
        ultimo_nome VARCHAR(100) NOT NULL, nome_completo VARCHAR(100) NOT NULL, 
        PRIMARY KEY (aluno_id))""")

In [35]:
# Passar por todas as linhas do DataFrame e fazer insert na DB
for _, row in df.iterrows():
    cur.execute("INSERT INTO aluno VALUES(%d,'%s','%s','%s')" % (row["aluno_id"], 
                                                           row["primeiro_nome"], 
                                                           row["ultimo_nome"], 
                                                           row["nome_completo"]))

In [36]:
# Verificar os dados da tabela (vamos apenas contar para ver se estão todos)
cur.execute("SELECT COUNT(*) FROM aluno").fetchone()

(61,)

7. Carregar os dados da tabela da bd para um novo dataframe (df1), com os registos ordenados por 
ordem alfabética de ‘nome_completo’.

In [37]:
# Decompor a lista de tuplos em 4 listas, uma para cada coluna
id, primeiro, ultimo, nome = zip(*cur.execute("SELECT * FROM aluno").fetchall())

In [38]:
# Fechar conexão da base de dados
conn.close()

In [39]:
df1 = pd.DataFrame({
    "aluno_id": id,
    "primeiro_nome": primeiro,
    "ultimo_nome": ultimo,
    "nome_completo": nome
})
df1

    aluno_id primeiro_nome ultimo_nome                    nome_completo
0     308011       BEATRIZ      COELHO  BEATRIZ ISABEL FERNANDES COELHO
1     158154       BEATRIZ   RODRIGUES         BEATRIZ MESTRE RODRIGUES
2     303284        DANIEL       SOUSA        DANIEL FERNANDES DE SOUSA
3     152335         DAVID      AFONSO     DAVID MIGUEL CARRONDO AFONSO
4     305412         DIOGO      SANTOS               DIOGO MALTA SANTOS
..       ...           ...         ...                              ...
56   3065613         SIMÃO       MAJOR          SIMÃO PAULO SILVA MAJOR
57   1495797         TOMÁS      SANTOS  TOMÁS AURÉLIO ABELHO DOS SANTOS
58   3075837        AFONSO       COSTA               AFONSO NEVES COSTA
59   1545968          JOÃO       NUNES        JOÃO MIGUEL MARTINS NUNES
60   3046075        RENATO       GOMES    RENATO JOSÉ DE OLIVEIRA GOMES

[61 rows x 4 columns]